# Створіть програму, яка буде запитувати в користувача його ім'я та вік,
# а у відповідь повертати повідомлення — "Привіт Олег, тобі 18!".

# name = input("Enter your name: ")
# age = int(input("Enter your age: "))
# print("Привіт", name, " тобі", age, "!")

# Створіть програму, яка буде запитувати в користувача його вік.
# Якщо користувачу більше 18-ти років, тоді виводити повідомлення "Вхід дозволено!", якщо ні, тоді "Вхід заборонено!".

# age = int(input("Enter your age: "))
#
# if age >= 18:
#     print("Отримайте повістку")
# elif age < 18 :
#     print("Гуляй поки що")


# Створіть гру "Вгадай число".
# Програма випадковим чином «загадує» число від 1 до 10,
# а користувач повинен вгадати це число.
# Якщо користувач вказує число більше ніж загадав комп'ютер,
# йому повинна виводиться підказка — «Менше»,
# якщо на навпаки, введе число менше — виводитиметься «Більше».
# У користувача є всього три спроби.

import random

r = random.randint(1, 10)
print(r)

for i in range(3):
    choice = int(input("Enter num: "))
    if choice > r:
        print("Tooooo big")
    elif choice < r:
        print("Tooooooooooooooooooooooooooo small")
    else:
        print("!!!!!!!!!!!!!!!!!!Вгадав!!!!!!!!!!!!!!!!!")
        break


# Створіть програму, в якій користувач буде вказувати два числа — *з* і *по* яке число виводити числа.
# Наприклад: 5 і 10, тоді у відповідь мають вивестись всі числа від 5 до 10.

# Створіть програму, яка буде виводити на екран,
# в рядок, тільки парні числа від 1 до n у зворотному порядку.

# Створіть програму, яка буде знаходити факторіал числа !n = 1*2*3*…*n.

# Створіть програму, яка буде визначати оцінку, що отримав студент,
# в залежності від кількості отриманих балів на екзамені:
# 0 - 49 — незадовільно.
# 50 - 69 — задовільно.
# 70 - 89 — добре.
# 90 - 100 — відмінно.

# Створіть програму калькулятор: програма повинна пропонувати по черзі ввести два числа (а, b), далі,
# користувачу необхідно вказати математичну дію, яку необхідно виконати з цими числами (+, -, *, /).
# Отриманий результат треба вивести на екран комп'ютера.
# Однак, якщо b=0 і вказується дія — ділення (/),
# то в цьому випадку програма повинна виводити підказку: «Ділення на нуль».